Create a database called temp_db. Open a cursor to this newly created database.

In [1]:
import sqlite3

# Connect to the database or create it if it doesn't exist
conn = sqlite3.connect("temp_db.db")
cursor = conn.cursor()

In the database temp_db created in Q.No.1, create a table called emp with the attributes empno, ename, salary and deptno\

In [2]:
# Create the emp table
cursor.execute("""CREATE TABLE IF NOT EXISTS emp (
                empno INTEGER PRIMARY KEY,
                ename TEXT,
                salary REAL,
                deptno INTEGER
                )""")
conn.commit()

In the emp table created in Q.No. 2, insert any five records.

In [ ]:
# Insert five records into the emp table
cursor.execute("INSERT INTO emp VALUES (1, 'John Doe', 22000, 10)")
cursor.execute("INSERT INTO emp VALUES (2, 'Jane Doe', 24000, 20)")
cursor.execute("INSERT INTO emp VALUES (3, 'Jim Smith', 21000, 10)")
cursor.execute("INSERT INTO emp VALUES (4, 'Michael Johnson', 26000, 30)")
cursor.execute("INSERT INTO emp VALUES (5, 'Emily Davis', 25000, 20)")
conn.commit()

From the emp table, display all the records.

In [3]:
# Display all records in the emp table
cursor.execute("SELECT * FROM emp")
print("All Records:")
for row in cursor.fetchall():
    print(row)

All Records:
(1, 'John Doe', 22000.0, 10)
(2, 'Jane Doe', 24000.0, 20)
(3, 'Jim Smith', 21000.0, 10)
(5, 'Emily Davis', 25000.0, 20)

From the emp table, display the records of only those employees whose salary is greater than 15000 and who belong to deptno 10

In [4]:
# Display records of employees with salary > 15000 and belonging to deptno 10
cursor.execute("SELECT * FROM emp WHERE salary > 15000 AND deptno = 10")
print("\nEmployees with salary > 15000 and belonging to deptno 10:")
for row in cursor.fetchall():
    print(row)

Employees with salary > 15000 and belonging to deptno 10:
(1, 'John Doe', 22000.0, 10)
(3, 'Jim Smith', 21000.0, 10)

From the emp table, display the records of only those employees whose salary lies between 20000 and 25000 and who do not belong to the deptno 10

In [5]:
# Display records of employees with salary between 20000 and 25000 and not belonging to deptno 10
cursor.execute("SELECT * FROM emp WHERE salary BETWEEN 20000 AND 25000 AND deptno != 10")
print("\nEmployees with salary between 20000 and 25000 and not belonging to deptno 10:")
for row in cursor.fetchall():
    print(row)

Employees with salary between 20000 and 25000 and not belonging to deptno 10:
(2, 'Jane Doe', 24000.0, 20)
(5, 'Emily Davis', 25000.0, 20)

From the emp table, display the records of only those employees whose name begins with M.

In [6]:
# Display records of employees whose name begins with 'M'
cursor.execute("SELECT * FROM emp WHERE ename LIKE 'M%'")
print("\nEmployees whose name begins with 'M':")
for row in cursor.fetchall():
    print(row)

Employees whose name begins with 'M':

In the emp table, delete the records of those employees who belong to deptno 30

In [7]:
# Delete records of employees belonging to deptno 30
cursor.execute("DELETE FROM emp WHERE deptno = 30")
conn.commit()

In the emp table, update the salary of an employee by 10 % by accepting the empno from the user.

In [10]:
# Update salary of an employee by 10%
empno = int(input("Enter empno of the employee: "))
cursor.execute("UPDATE emp SET salary = salary * 1.1 WHERE empno = ?", (empno,))
conn.commit()

Enter empno of the employee: 3

Delete the emp table.

In [11]:
# Delete the emp table
cursor.execute("DROP TABLE emp")
conn.commit()

# Close the connection to the database
conn.close()